Repository: WordPressBugBounty/plugins-greek-multi-tool
Catalog: greek-multi-tool/languages/greek-multi-tool-*.po
Languages: el

source: This plugin provides a handful of tools and key functionalities to simplify and fix the greek language used in your webpage. For example it change the greek character urls to latin, remove the uppercase accents.
el: Αυτό το πρόσθετο παρέχει μια σειρά από εργαλεία και βασικές λειτουργίες για την απλοποίηση και διόρθωση της ελληνικής γλώσσας που χρησιμοποιείται στην ιστοσελίδα σας. Για παράδειγμα, μετατρέπει τις διευθύνσεις URL με ελληνικούς χαρακτήρες σε λατινικούς και αφαιρεί τους τόνους από τα κεφαλαία.

source: 301 REDIRECT SETTINGS
el: ΡΥΘΜΙΣΕΙΣ ΑΝΑΚΑΤΕΥΘΥΝΣΗΣ 301

source: Enable Automatic 301 Redirect
el: Ενεργοποίηση Αυτόματης Ανακατεύθυνσης 301

source: Enabling the automatic 301 redirect option setting will create dynamic redirects for every old permalink being converted via the `Convert Old Permalinks` functionality.
el: Η ενεργοποίηση της επιλογής αυτόματης ανακατεύθυνσης 301 θα δημιουργήσει δυναμικές ανακατευθύνσεις για κάθε παλιό permalink που μετατρέπεται μέσω της λειτουργίας `Μετατροπή Παλαιών Permalinks`.

source: MANAGE OLD PERMALINKS
el: ΔΙΑΧΕΙΡΙΣΗ ΠΑΛΑΙΩΝ PERMALINKS

source: Convert All Old Permalinks
el: Μετατροπή Όλων των Παλαιών Permalinks

source: Press the button bellow to initialize the conversion of all old permalinks
el: Πατήστε το παρακάτω κουμπί για να ξεκινήσετε τη μετατροπή όλων των παλαιών permalinks

source: CONVERT
el: ΜΕΤΑΤΡΟΠΗ

source: List of old permalinks
el: Λίστα παλαιών permalinks

source: In the list below you can view/manage the old converted permalinks
el: Στην παρακάτω λίστα μπορείτε να προβάλετε/διαχειριστείτε τα παλαιά μετατρεπόμενα permalinks

source: Post ID:
el: ID Άρθρου:

source: Old Permalink:
el: Παλιό Permalink:

source: New Permalink:
el: Νέο Permalink:

source: Edit Redirection
el: Επεξεργασία Ανακατεύθυνσης

source: Make sure you are making the correct changes, as editting redirection permalinks while redirection is still active may result in broken URLs or Loops
el: Βεβαιωθείτε ότι κάνετε τις σωστές αλλαγές, καθώς η επεξεργασία των permalinks ανακατεύθυνσης ενώ η ανακατεύθυνση είναι ακόμα ενεργή μπορεί να οδηγήσει σε κατεστραμμένα URL ή βρόχους

source: Cancel
el: Ακύρωση

source: Save Changes
el: Αποθήκευση Αλλαγών

source: Delete Redirection
el: Διαγραφή Ανακατεύθυνσης

source: Are you sure you want to delete this redirect record?
el: Είστε βέβαιοι ότι θέλετε να διαγράψετε αυτή την εγγραφή ανακατεύθυνσης;

source: Delete
el: Διαγραφή

source: No Permalinks Found
el: Δεν Βρέθηκαν Permalinks

source: Feedback
el: Ανατροφοδότηση

source: FEEDBACK & SUGGESTIONS
el: ΣΧΟΛΙΑ & ΠΡΟΤΑΣΕΙΣ

source: Help Us Improve Greek Multi-Tool
el: Βοηθήστε μας να Βελτιώσουμε το Greek Multi-Tool

source: We value your feedback and suggestions for enhancing our tools for Greek websites.
el: Εκτιμούμε τα σχόλια και τις προτάσεις σας για τη βελτίωση των εργαλείων μας για ελληνικές ιστοσελίδες.

source: We'd Love to Hear From You!
el: Θα Θέλαμε να Ακούσουμε από Εσάς!

source: Have ideas for new features? Found a bug? Have suggestions for improving existing tools? Let us know!
el: Έχετε ιδέες για νέα χαρακτηριστικά; Βρήκατε κάποιο σφάλμα; Έχετε προτάσεις για τη βελτίωση των υφιστάμενων εργαλείων; Ενημερώστε μας!

source: Contact Options
el: Επιλογές Επικοινωνίας

source: Contact Us via Our Website
el: Επικοινωνήστε Μαζί μας μέσω της Ιστοσελίδας μας

source: Greek Excerpt Settings
el: Ρυθμίσεις Ελληνικού Αποσπάσματος

source: Enable Greek Excerpts
el: Ενεργοποίηση Ελληνικών Αποσπασμάτων

source: Greek Excerpt Length
el: Μήκος Ελληνικού Αποσπάσματος

source: Greek Read More Text
el: Κείμενο "Διαβάστε Περισσότερα" στα Ελληνικά

source: Configure how excerpts are generated for Greek text.
el: Διαμορφώστε τον τρόπο δημιουργίας αποσπασμάτων για ελληνικό κείμενο.

source: Enable Greek-friendly excerpt generation. When disabled, WordPress will use its default excerpt generation.
el: Ενεργοποιήστε τη δημιουργία φιλικών προς τα ελληνικά αποσπασμάτων. Όταν είναι απενεργοποιημένο, το WordPress θα χρησιμοποιεί την προεπιλεγμένη δημιουργία αποσπασμάτων.

source: Number of words to show in Greek excerpts (default WordPress value is 55).
el: Αριθμός λέξεων που θα εμφανίζονται στα ελληνικά αποσπάσματα (η προεπιλεγμένη τιμή του WordPress είναι 55).

source: Text to append after truncated excerpts (default is "…").
el: Κείμενο που θα προστεθεί μετά από περικομμένα αποσπάσματα (προεπιλογή είναι "…").

source: Greek-Friendly Excerpt
el: Φιλικό προς τα Ελληνικά Απόσπασμα

source: Greek-friendly excerpt generator creates proper excerpts for Greek text, ensuring words are not cut off incorrectly.
el: Η γεννήτρια φιλικών προς τα ελληνικά αποσπασμάτων δημιουργεί σωστά αποσπάσματα για ελληνικό κείμενο, διασφαλίζοντας ότι οι λέξεις δεν κόβονται λανθασμένα.

source: Current Excerpt:
el: Τρέχον Απόσπασμα:

source: Generated Greek-Friendly Excerpt:
el: Δημιουργημένο Φιλικό προς τα Ελληνικά Απόσπασμα:

source: Manual Edit:
el: Χειροκίνητη Επεξεργασία:

source: Edit excerpt manually...
el: Επεξεργασία αποσπάσματος χειροκίνητα...

source: Refresh Generated Excerpt
el: Ανανέωση Δημιουργημένου Αποσπάσματος

source: Use Generated Excerpt
el: Χρήση Δημιουργημένου Αποσπάσματος

source: Save Manual Excerpt
el: Αποθήκευση Χειροκίνητου Αποσπάσματος

source: Custom Length:
el: Προσαρμοσμένο Μήκος:

source: Apply
el: Εφαρμογή

source: Error refreshing excerpt
el: Σφάλμα ανανέωσης αποσπάσματος

source: Generated excerpt successfully applied to post!
el: Το δημιουργημένο απόσπασμα εφαρμόστηκε με επιτυχία στην ανάρτηση!

source: Error applying excerpt
el: Σφάλμα εφαρμογής αποσπάσματος

source: Manual excerpt successfully saved!
el: Το χειροκίνητο απόσπασμα αποθηκεύτηκε με επιτυχία!

source: Error saving excerpt
el: Σφάλμα αποθήκευσης αποσπάσματος

source: Invalid post ID
el: Μη έγκυρο ID ανάρτησης

source: Post not found
el: Η ανάρτηση δεν βρέθηκε

source: Error updating post excerpt
el: Σφάλμα ενημέρωσης αποσπάσματος ανάρτησης

source: Invalid field
el: Μη έγκυρο πεδίο

source: Excerpts
el: Αποσπάσματα

source: Settings saved.
el: Οι ρυθμίσεις αποθηκεύτηκαν.

source: GREEK EXCERPT GENERATOR
el: ΓΕΝΝΗΤΡΙΑ ΕΛΛΗΝΙΚΩΝ ΑΠΟΣΠΑΣΜΑΤΩΝ

source: Greek-Friendly Excerpt Generator
el: Γεννήτρια Φιλικών προς τα Ελληνικά Αποσπασμάτων

source: Fix WordPress excerpt issues with Greek text
el: Διόρθωση προβλημάτων αποσπασμάτων του WordPress με ελληνικό κείμενο

source: Enable Greek-friendly excerpt generation
el: Ενεργοποίηση δημιουργίας φιλικών προς τα ελληνικά αποσπασμάτων

source: When disabled, WordPress will use its default excerpt generation.
el: Όταν είναι απενεργοποιημένο, το WordPress θα χρησιμοποιεί την προεπιλεγμένη δημιουργία αποσπασμάτων.

source: Features:
el: Χαρακτηριστικά:

source: This feature fixes how WordPress generates excerpts for Greek text.
el: Αυτό το χαρακτηριστικό διορθώνει τον τρόπο με τον οποίο το WordPress δημιουργεί αποσπάσματα για ελληνικό κείμενο.

source: Properly handles Greek word boundaries
el: Διαχειρίζεται σωστά τα όρια των ελληνικών λέξεων

source: Ensures Greek words are not cut off mid-character
el: Εξασφαλίζει ότι οι ελληνικές λέξεις δεν κόβονται στη μέση του χαρακτήρα

source: Removes shortcodes and page builder elements
el: Αφαιρεί shortcodes και στοιχεία των page builders

source: Customizable excerpt length specifically for Greek text
el: Προσαρμόσιμο μήκος αποσπάσματος ειδικά για ελληνικό κείμενο

source: Custom "read more" text
el: Προσαρμοσμένο κείμενο "διαβάστε περισσότερα"

source: Adds a meta box in the post editor for generating and previewing excerpts
el: Προσθέτει ένα meta box στον επεξεργαστή αναρτήσεων για τη δημιουργία και την προεπισκόπηση αποσπασμάτων

source: Manual editing capability for fine-tuning excerpts
el: Δυνατότητα χειροκίνητης επεξεργασίας για βελτιστοποίηση αποσπασμάτων

source: Greek Multi Tool Settings Page
el: Σελίδα Ρυθμίσεων Greek Multi Tool

source: Welcome,
el: Καλώς ήρθατε,

source: Congratulations! You are about to use the most powerful WordPress plugin for Greek Language Users - Greek Multi Tool is designed to make the process of using the Greek Language in WordPress as ease as possible.
el: Συγχαρητήρια! Πρόκειται να χρησιμοποιήσετε το πιο ισχυρό πρόσθετο WordPress για χρήστες της Ελληνικής Γλώσσας - Το Greek Multi Tool έχει σχεδιαστεί για να κάνει τη διαδικασία χρήσης της Ελληνικής Γλώσσας στο WordPress όσο το δυνατόν πιο εύκολη.

source: Support Forum
el: Φόρουμ Υποστήριξης

source: Review the Plugin on WordPress Repository
el: Αξιολογήστε το Πρόσθετο στο Αποθετήριο του WordPress

source: Permalinks Settings
el: Ρυθμίσεις Permalinks

source: Uppercase Accent Remover Settings
el: Ρυθμίσεις Αφαίρεσης Τόνων Κεφαλαίων

source: Manage Old Permalinks
el: Διαχείριση Παλαιών Permalinks

source: 301 Redirect Settings
el: Ρυθμίσεις Ανακατεύθυνσης 301

source: Menu Builder
el: Κατασκευαστής Μενού

source: Save Settings
el: Αποθήκευση Ρυθμίσεων

source: MENU BUILDER
el: ΚΑΤΑΣΚΕΥΑΣΤΗΣ ΜΕΝΟΥ

source: Woocomerce Products Category Menu
el: Μενού Κατηγοριών Προϊόντων Woocommerce

source: To create a custom menu for your WooCommerce store effortlessly, simply enter your preferred menu name in the form below. Click 'Create,' and voilà! A new menu with the name you specified will be automatically generated. This menu will intuitively organize all your WooCommerce product categories, following their existing hierarchy.
el: Για να δημιουργήσετε ένα προσαρμοσμένο μενού για το κατάστημα WooCommerce σας χωρίς κόπο, απλώς εισάγετε το προτιμώμενο όνομα μενού στη φόρμα παρακάτω. Κάντε κλικ στο 'Δημιουργία' και έτοιμο! Ένα νέο μενού με το όνομα που καθορίσατε θα δημιουργηθεί αυτόματα. Αυτό το μενού θα οργανώσει διαισθητικά όλες τις κατηγορίες προϊόντων του WooCommerce, ακολουθώντας την υπάρχουσα ιεραρχία τους.

source: Enter a name for the Menu...
el: Εισάγετε ένα όνομα για το Μενού...

source: Create Menu
el: Δημιουργία Μενού

source: Posts Category Menu
el: Μενού Κατηγοριών Αναρτήσεων

source: To effortlessly create a custom menu for your WordPress blog, simply enter your preferred menu name in the form below. Click 'Create,' and voilà! A new menu with the name you specified will be automatically generated. This menu will intuitively organize all your WordPress post categories, following their existing hierarchy.
el: Για να δημιουργήσετε εύκολα ένα προσαρμοσμένο μενού για το ιστολόγιο WordPress σας, απλώς εισαγάγετε το προτιμώμενο όνομα μενού στη φόρμα παρακάτω. Κάντε κλικ στο 'Δημιουργία', και έτοιμο! Ένα νέο μενού με το όνομα που καθορίσατε θα δημιουργηθεί αυτόματα. Αυτό το μενού θα οργανώσει διαισθητικά όλες τις κατηγορίες αναρτήσεων του WordPress, ακολουθώντας την υπάρχουσα ιεραρχία τους.

source: You do not have sufficient permissions to access this page.
el: Δεν έχετε επαρκή δικαιώματα για πρόσβαση σε αυτή τη σελίδα.

source: PERMALINK SETTINGS
el: ΡΥΘΜΙΣΕΙΣ PERMALINK

source: Convert the permalinks
el: Μετατροπή των permalinks

source: Enable the permalinks convert sitewide
el: Ενεργοποίηση της μετατροπής permalinks σε όλο τον ιστότοπο

source: Enable Greeklish Permalinks Convert:
el: Ενεργοποίηση Μετατροπής Greeklish Permalinks:

source: Automatically convert the greek characters to latin in all permalinks in posts, pages, custom post type and terms.
el: Αυτόματη μετατροπή των ελληνικών χαρακτήρων σε λατινικούς σε όλα τα permalinks σε αναρτήσεις, σελίδες, προσαρμοσμένους τύπους αναρτήσεων και όρους.

source: Diphthongs Settings
el: Ρυθμίσεις Διφθόγγων

source: Select how you want the dipthongs to be converted
el: Επιλέξτε πώς θέλετε να μετατραπούν οι δίφθογγοι

source: Simple Conversion
el: Απλή Μετατροπή

source: For example "ει" becomes "ei", "οι" becomes "οi", "μπ" becomes "mp" etc
el: Για παράδειγμα, το "ει" γίνεται "ei", το "οι" γίνεται "οi", το "μπ" γίνεται "mp" κλπ

source: Advance Conversion
el: Προηγμένη Μετατροπή

source: For example "ει", "οι" becomes "i", "μπ" becomes "b" etc
el: Για παράδειγμα, το "ει", "οι" γίνεται "i", το "μπ" γίνεται "b" κλπ

source: Remove One/Two Letter Words
el: Αφαίρεση Λέξεων με Ένα/Δύο Γράμματα

source: Select which of the following word options you want to remove from the posts urls
el: Επιλέξτε ποιες από τις παρακάτω επιλογές λέξεων θέλετε να αφαιρέσετε από τα URL των αναρτήσεων

source: Remove One Letter Words
el: Αφαίρεση Λέξεων με Ένα Γράμμα

source: Remove Two Letter Words
el: Αφαίρεση Λέξεων με Δύο Γράμματα

source: Exclude Stopwords From Permalinks
el: Εξαίρεση Λέξεων Διακοπής από Permalinks

source: Type the words you want to exclude from permalinks seperated by a comma!
el: Πληκτρολογήστε τις λέξεις που θέλετε να εξαιρέσετε από τα permalinks διαχωρισμένες με κόμμα!

source: Word "%s" is all-caps and should not have accents
el: Η λέξη "%s" είναι όλη με κεφαλαία και δεν πρέπει να έχει τόνους

source: Word "%s" should not have an accent
el: Η λέξη "%s" δεν πρέπει να έχει τόνο

source: Multi-syllable word "%s" should have an accent
el: Η πολυσύλλαβη λέξη "%s" πρέπει να έχει τόνο

source: Word "%s" should have an accent in this context
el: Η λέξη "%s" πρέπει να έχει τόνο σε αυτό το πλαίσιο

source: Monosyllabic word "%s" should not have an accent
el: Η μονοσύλλαβη λέξη "%s" δεν πρέπει να έχει τόνο

source: Greek Text Analysis
el: Ανάλυση Ελληνικού Κειμένου

source: Analyze your content for proper Greek accent rules.
el: Αναλύστε το περιεχόμενό σας για σωστούς κανόνες τονισμού στα Ελληνικά.

source: Analyze Text
el: Ανάλυση Κειμένου

source: Analyzing...
el: Ανάλυση...

source: Text Statistics
el: Στατιστικά Κειμένου

source: Characters:
el: Χαρακτήρες:

source: Words:
el: Λέξεις:

source: Greek characters:
el: Ελληνικοί χαρακτήρες:

source: Accented characters:
el: Τονισμένοι χαρακτήρες:

source: Accent Rule Issues
el: Προβλήματα Κανόνων Τονισμού

source: No accent rule issues found!
el: Δεν βρέθηκαν προβλήματα κανόνων τονισμού!

source: Error analyzing text.
el: Σφάλμα κατά την ανάλυση κειμένου.

source: You do not have permission to perform this action.
el: Δεν έχετε άδεια για την εκτέλεση αυτής της ενέργειας.

source: No content to analyze.
el: Δεν υπάρχει περιεχόμενο για ανάλυση.

source: Text Analysis
el: Ανάλυση Κειμένου

source: TEXT ANALYSIS SETTINGS
el: ΡΥΘΜΙΣΕΙΣ ΑΝΑΛΥΣΗΣ ΚΕΙΜΕΝΟΥ

source: Greek Accent Rules Analysis
el: Ανάλυση Κανόνων Τονισμού στα Ελληνικά

source: Analyze your content for proper Greek accent rule usage
el: Αναλύστε το περιεχόμενό σας για τη σωστή χρήση κανόνων τονισμού στα Ελληνικά

source: Accent Rules Checked:
el: Κανόνες Τονισμού που Ελέγχονται:

source: This feature adds a metabox to your post and page editor that analyzes Greek text for accent rule compliance.
el: Αυτό το χαρακτηριστικό προσθέτει ένα metabox στον επεξεργαστή αναρτήσεων και σελίδων που αναλύει το ελληνικό κείμενο για συμμόρφωση με τους κανόνες τονισμού.

source: All words with two or more syllables must have an accent
el: Όλες οι λέξεις με δύο ή περισσότερες συλλαβές πρέπει να έχουν τόνο

source: Words that appear monosyllabic after elision or apocope keep their accent
el: Οι λέξεις που φαίνονται μονοσύλλαβες μετά από έκθλιψη ή αποκοπή διατηρούν τον τόνο τους

source: Words that have lost their accent through aphaeresis are exceptions
el: Οι λέξεις που έχουν χάσει τον τόνο τους λόγω αφαίρεσης αποτελούν εξαιρέσεις

source: Monosyllabic words generally do not take accents, with specific exceptions
el: Οι μονοσύλλαβες λέξεις γενικά δεν παίρνουν τόνους, με συγκεκριμένες εξαιρέσεις

source: Common Greek words like "Όλα", "Ένα", "Όταν" are recognized as correctly accented
el: Κοινές ελληνικές λέξεις όπως "Όλα", "Ένα", "Όταν" αναγνωρίζονται ως σωστά τονισμένες

source: Certain words like "μου", "σου", "του", "το", "τα", "για", "πιο", "ναι", "και", "οι", etc. never take accents
el: Ορισμένες λέξεις όπως "μου", "σου", "του", "το", "τα", "για", "πιο", "ναι", "και", "οι", κλπ. δεν παίρνουν ποτέ τόνους

source: The disjunctive conjunction "ή" always takes an accent
el: Ο διαζευκτικός σύνδεσμος "ή" παίρνει πάντα τόνο

source: Interrogative "πού" and "πώς" always take accents in questions
el: Τα ερωτηματικά "πού" και "πώς" παίρνουν πάντα τόνους στις ερωτήσεις

source: Special cases for "πού" and "πώς" in specific phrases
el: Ειδικές περιπτώσεις για τα "πού" και "πώς" σε συγκεκριμένες φράσεις

source: All-caps words should not have accents (except for "Ή")
el: Οι λέξεις με όλα κεφαλαία δεν πρέπει να έχουν τόνους (εκτός από το "Ή")

source: The text analysis metabox will appear in the sidebar of your post and page editors.
el: Το metabox ανάλυσης κειμένου θα εμφανίζεται στην πλαϊνή μπάρα των επεξεργαστών αναρτήσεων και σελίδων σας.

source: UPPERCASE ACCENT REMOVER SETTINGS
el: ΡΥΘΜΙΣΕΙΣ ΑΦΑΙΡΕΣΗΣ ΤΟΝΩΝ ΚΕΦΑΛΑΙΩΝ

source: Remove Uppercase Accents
el: Αφαίρεση Τόνων Κεφαλαίων

source: Enable the uppercase accent remover sitewide
el: Ενεργοποίηση της αφαίρεσης τόνων κεφαλαίων σε όλο τον ιστότοπο

source: Enable Uppercase Accents Remover:
el: Ενεργοποίηση Αφαίρεσης Τόνων Κεφαλαίων:

source: Automatically remove accented characters from elements having their text content uppercase transformed through CSS.
el: Αυτόματη αφαίρεση τονισμένων χαρακτήρων από στοιχεία που έχουν το περιεχόμενο κειμένου τους μετατραπεί σε κεφαλαία μέσω CSS.

source: Enable enhanced Greek search
el: Ενεργοποίηση βελτιωμένης ελληνικής αναζήτησης

source: Post types to include in search
el: Τύποι αναρτήσεων για συμπερίληψη στην αναζήτηση

source: GREEK SEARCH SETTINGS
el: ΡΥΘΜΙΣΕΙΣ ΕΛΛΗΝΙΚΗΣ ΑΝΑΖΗΤΗΣΗΣ

source: Enhanced Greek Search
el: Βελτιωμένη Ελληνική Αναζήτηση

source: Improve WordPress search for Greek content by handling accents and diphthongs
el: Βελτίωση της αναζήτησης WordPress για ελληνικό περιεχόμενο με χειρισμό τόνων και διφθόγγων

source: Enable Enhanced Greek Search:
el: Ενεργοποίηση Βελτιωμένης Ελληνικής Αναζήτησης:

source: Improve search results for Greek content by handling accents and diphthongs.
el: Βελτίωση των αποτελεσμάτων αναζήτησης για ελληνικό περιεχόμενο με χειρισμό τόνων και διφθόγγων.

source: Post Types to Include in Search:
el: Τύποι Αναρτήσεων για Συμπερίληψη στην Αναζήτηση:

source: Select which post types should be included in the enhanced search.
el: Επιλέξτε ποιοι τύποι αναρτήσεων πρέπει να συμπεριληφθούν στη βελτιωμένη αναζήτηση.

source: Search
el: Αναζήτηση

source: Error: Search tab content file not found
el: Σφάλμα: Το αρχείο περιεχομένου καρτέλας αναζήτησης δεν βρέθηκε

source: Enable Greek date localization
el: Ενεργοποίηση τοπικοποίησης ελληνικών ημερομηνιών

source: Greek date format
el: Μορφή ελληνικής ημερομηνίας

source: Custom Greek date format
el: Προσαρμοσμένη μορφή ελληνικής ημερομηνίας

source: GREEK DATE LOCALIZATION
el: ΤΟΠΙΚΟΠΟΙΗΣΗ ΕΛΛΗΝΙΚΩΝ ΗΜΕΡΟΜΗΝΙΩΝ

source: Greek Date Format Settings
el: Ρυθμίσεις Μορφής Ελληνικής Ημερομηνίας

source: Properly display dates in Greek format with Greek month and day names
el: Σωστή εμφάνιση ημερομηνιών σε ελληνική μορφή με ελληνικά ονόματα μηνών και ημερών

source: Default (1 Ιανουαρίου 2023)
el: Προεπιλογή (1 Ιανουαρίου 2023)

source: Full (Δευτέρα, 1 Ιανουαρίου 2023)
el: Πλήρης (Δευτέρα, 1 Ιανουαρίου 2023)

source: Short (1/1/2023)
el: Σύντομη (1/1/2023)

source: With time (1 Ιανουαρίου 2023, 13:45)
el: Με ώρα (1 Ιανουαρίου 2023, 13:45)

source: Archive (Ιανουαρίου 2023)
el: Αρχείο (Ιανουαρίου 2023)

source: Custom format
el: Προσαρμοσμένη μορφή

source: Enable Greek Date Localization:
el: Ενεργοποίηση Τοπικοποίησης Ελληνικών Ημερομηνιών:

source: Display dates with Greek month and day names throughout the site.
el: Εμφάνιση ημερομηνιών με ελληνικά ονόματα μηνών και ημερών σε όλο τον ιστότοπο.

source: Date Format:
el: Μορφή Ημερομηνίας:

source: Select how dates should be formatted throughout the site.
el: Επιλέξτε πώς πρέπει να μορφοποιηθούν οι ημερομηνίες σε όλο τον ιστότοπο.

source: e.g., j F Y
el: π.χ., j F Y

source: Use PHP date format. For example, "j F Y" outputs "1 Ιανουαρίου 2023".
el: Χρησιμοποιήστε τη μορφή ημερομηνίας PHP. Για παράδειγμα, το "j F Y" εμφανίζει "1 Ιανουαρίου 2023".

source: Reference
el: Αναφορά

source: Date Localization
el: Τοπικοποίηση Ημερομηνιών

source: Error: Date localization tab content file not found
el: Σφάλμα: Το αρχείο περιεχομένου καρτέλας τοπικοποίησης ημερομηνιών δεν βρέθηκε

source: Settings
el: Ρυθμίσεις

source: Unauthorized access
el: Μη εξουσιοδοτημένη πρόσβαση

source: Security check failed
el: Ο έλεγχος ασφαλείας απέτυχε

source: Invalid record ID
el: Μη έγκυρο ID εγγραφής

source: Record deleted successfully
el: Η εγγραφή διαγράφηκε με επιτυχία

source: Failed to delete record
el: Αποτυχία διαγραφής εγγραφής

source: Invalid request
el: Μη έγκυρο αίτημα

source: Invalid permalink values
el: Μη έγκυρες τιμές permalink

source: Record updated successfully
el: Η εγγραφή ενημερώθηκε με επιτυχία

source: Failed to update record
el: Αποτυχία ενημέρωσης εγγραφής
