Repository: WordPressBugBounty/plugins-greek-multi-tool
Catalog: greek-multi-tool/languages/grmlt-plugin.po
Languages: el

source: 301 REDIRECT SETTINGS
el: Ρυθμίσεις Permalinks

source: Enable Automatic 301 Redirect
el: Ενεργοποίηση αυτόματης ανακατεύθυνσης 301

source: Enabling the automatic 301 redirect option setting will create dynamic redirects for every old permalink being converted via the `Convert Old Permalinks` functionality.
el: Η ενεργοποίηση της ρύθμισης της επιλογής αυτόματης ανακατεύθυνσης 301 θα δημιουργήσει δυναμικές ανακατευθύνσεις για κάθε παλιό permalink που μετατρέπεται μέσω της λειτουργίας "Μετατροπή παλαιών Permalinks".

source: MANAGE OLD PERMALINKS
el: ΔΙΑΧΕΊΡΙΣΗ ΠΑΛΑΙΏΝ PERMALINKS

source: Convert All Old Permalinks
el: Μετατροπή όλων των παλαιών μόνιμων συνδέσμων

source: Press the button bellow to initialize the conversion of all old permalinks
el: Πατήστε το παρακάτω κουμπί για να αρχικοποιήσετε τη μετατροπή όλων των παλιών μόνιμων συνδέσμων

source: CONVERT
el: ΜΕΤΑΤΡΟΠΗ

source: List of old permalinks
el: Λίστα παλαιών permalinks

source: In the list below you can view/manage the old converted permalinks
el: Στην παρακάτω λίστα μπορείτε να δείτε/διαχειριστείτε τους παλιούς permalinks που έχουν μετατραπεί

source: Post ID:
el: ID Άρθρου:

source: Old Permalink:
el: Παλιό Permalink:

source: New Permalink:
el: Νέο Permalink:

source: Edit Redirection
el: Επεξεργασία Ανακατεύθυνσης

source: Make sure you are making the correct changes, as editting redirection permalinks while redirection is still active may result in broken URLs or Loops
el: Βεβαιωθείτε ότι κάνετε τις σωστές αλλαγές, καθώς η επεξεργασία των μόνιμων συνδέσμων ανακατεύθυνσης ενώ η ανακατεύθυνση είναι ακόμα ενεργή μπορεί να οδηγήσει σε κατεστραμμένα URL ή βρόχους

source: Cancel
el: Ακύρωση

source: Save Changes
el: Αποθήκευση Αλλαγών

source: Delete Redirection
el: Διαγραφή Ανακατεύθυνσης

source: Are you sure you want to delete this redirect record?
el: Είστε βέβαιοι ότι θέλετε να διαγράψετε αυτήν την εγγραφή ανακατεύθυνσης;

source: Delete
el: Διαγραφή

source: No Permalinks Found
el: Δεν βρέθηκαν σύνδεσμοι

source: Welcome,
el: Καλώς ήρθατε,

source: Congratulations! You are about to use the most powerful WordPress plugin for Greek Language Users - Greek Multi Tool is designed to make the process of using the Greek Language in WordPress as ease as possible.
el: Συγχαρητήρια! Είστε έτοιμοι να χρησιμοποιήσετε το πιο ισχυρό WordPress plugin για χρήστες της ελληνικής γλώσσας - το Greek Multi Tool έχει σχεδιαστεί για να κάνει τη διαδικασία χρήσης της ελληνικής γλώσσας στο WordPress όσο το δυνατόν πιο εύκολη.

source: Support Forum
el: Φόρουμ υποστήριξης

source: Review the Plugin on WordPress Repository
el: Ελέγξτε την προσθήκη στο αποθετήριο του WordPress

source: Permalinks Settings
el: Ρυθμίσεις Permalinks

source: Uppercase Accent Remover Settings
el: Ρυθμίσεις Αφαίρεσης Προφοράς Κεφαλαίων

source: Manage Old Permalinks
el: ΜΕΤΑΤΡΟΠΗ ΠΑΛΑΙΩΝ ΜΟΝΙΜΩΝ ΣΥΝΔΕΣΜΩΝ

source: 301 Redirect Settings
el: Ρυθμίσεις Permalinks

source: PERMALINK SETTINGS
el: Σελίδα ρυθμίσεων Greeklish Multi Tool

source: Convert the permalinks
el: Μετατροπή Ελληνικών Πέρμαλινκς

source: Enable the permalinks convert sitewide
el: Ενεργοποίηση global μετατροπής permalink

source: Enable Greeklish Permalinks Convert:
el: Ενεργοποίηση του μετατροπέα permalink

source: Automatically convert the greek characters to latin in all permalinks in posts, pages, custom post type and terms.
el: Αυτόματη μετατροπή των ελληνικών χαρακτήρων σε λατινικούς σε όλους τους υπερσυνδέσμους σε αναρτήσεις, σελίδες, προσαρμοσμένους τύπους αναρτήσεων και όρους.

source: Diphthongs Settings
el: Ρυθμίσεις διφθόγγων

source: Select how you want the dipthongs to be converted
el: Επιλέξτε πώς θέλετε να μετατραπούν οι δίφθογγοι

source: Simple Conversion
el: Απλή Μετατροπή

source: For example "ει" becomes "ei", "οι" becomes "οi", "μπ" becomes "mp" etc
el: Για παράδειγμα το "ει" γίνεται "ei", το "οι" γίνεται "oi", το "μπ" γίνεται "mp" κτλπ..

source: Advance Conversion
el: Ειδική Μετατροπή

source: For example "ει", "οι" becomes "i", "μπ" becomes "b" etc
el: Για παράδειγμα το "ει", "οι" γίνεται "i", το "μπ" γίνεται "b" κτλπ..

source: Remove One/Two Letter Words
el: Αφαίρεση λέξεων με ένα γράμμα

source: Select which of the following word options you want to remove from the posts urls
el: Επιλέξτε ποιες από τις παρακάτω λέξεις θέλετε να αφαιρέσετε από τους συνδέσμους των άρθρων

source: Remove One Letter Words
el: Αφαίρεση λέξεων με ένα γράμμα

source: Remove Two Letter Words
el: Αφαίρεση λέξεων με δύο γράμματα

source: Exclude Stopwords From Permalinks
el: ΑΠΟΚΡΥΨΤΕ ΕΝΔΙΑΜΕΣΕΣ ΛΕΞΕΙΣ ΑΠΟ ΤΟΥΣ ΣΥΝΔΕΣΜΟΥΣ

source: Type the words you want to exclude from permalinks seperated by a comma!
el: Πληκτρολογήστε τις λέξεις που θέλετε να εξαιρέσετε από τους μόνιμους συνδέσμους που χωρίζονται με κόμμα!

source: UPPERCASE ACCENT REMOVER SETTINGS
el: ΡΥΘΜΙΣΕΙΣ ΑΦΑΙΡΕΣΗΣ ΤΟΝΙΣΜΟΥ ΚΕΦΑΛΑΙΩΝ

source: Remove Uppercase Accents
el: Αφαιρεση Τονισμου Κεφαλαιων

source: Enable the uppercase accent remover sitewide
el: Ενεργοποιήστε το εργαλείο αφαίρεσης κεφαλαίων τονισμού σε όλο τον ιστότοπο

source: Enable Uppercase Accents Remover:
el: Ενεργοποίηση την αφαίρεση κεφαλαίων τονισμών

source: Automatically remove accented characters from elements having their text content uppercase transformed through CSS.
el: Καταργήστε αυτόματα τους τονισμένους χαρακτήρες από στοιχεία με κεφαλαία μετατροπή του περιεχομένου κειμένου τους μέσω CSS.
